content/posts/A_kinetic_view_of_statistical_physics_by_Krapivsky,_Redner,_and_Ben-Naim_in_2010.md
+++
title = "A kinetic view of statistical physics by Krapivsky, Redner, and Ben-Naim in 2010"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:33:39-04:00
slug = "A_kinetic_view_of_statistical_physics_by_Krapivsky,_Redner,_and_Ben-Naim_in_2010"
draft = false
+++

## Lectures {#lectures}


### Krapivsky, P. L., Redner, S., & Ben-Naim, E. (2010). <span class="underline"><span class="underline">A Kinetic View of Statistical Physics</span></span>. Retrieved from <https://www.youtube.com/playlist?list=PLNFIflbQ6VNv%5FKKn9eKn32q6f6WstaEwk> {#krapivsky-p-dot-l-dot-redner-s-dot-and-ben-naim-e-dot--2010--dot-dot-retrieved-from-https-www-dot-youtube-dot-com-playlist-list-plnfiflbq6vnv-kkn9ekn32q6f6wstaewk}


## 1. Aperitifs {#1-dot-aperitifs}


### 1.1 Diffusion {#1-dot-1-diffusion}


### 1.2 Single-species annihilation/coalescence {#1-dot-2-single-species-annihilation-coalescence}


### 1.3 Two-species {#1-dot-3-two-species}


### 1.4 Notes {#1-dot-4-notes}


## 2. Diffusion {#2-dot-diffusion}


### 2.1 The probability distribution {#2-dot-1-the-probability-distribution}


### 2.2 Central limit theorem {#2-dot-2-central-limit-theorem}


### 2.3 Walks with broad distributions {#2-dot-3-walks-with-broad-distributions}


### 2.4 Application to gravity: the Holtsmark distribution {#2-dot-4-application-to-gravity-the-holtsmark-distribution}


### 2.5 First-passage properties {#2-dot-5-first-passage-properties}


### 2.6 Exit probabilities and exit times {#2-dot-6-exit-probabilities-and-exit-times}


### 2.7 Reaction rate theory {#2-dot-7-reaction-rate-theory}


### 2.8 The Langevin approach {#2-dot-8-the-langevin-approach}


### 2.9 Application to surface growth {#2-dot-9-application-to-surface-growth}


### 2.10 Notes {#2-dot-10-notes}


## 3. Collisions {#3-dot-collisions}


### 3.1 Kinetic theory {#3-dot-1-kinetic-theory}


### 3.2 The Lorentz gas {#3-dot-2-the-lorentz-gas}


### 3.3 Lorentz gas in an external field {#3-dot-3-lorentz-gas-in-an-external-field}


### 3.4 Collisional impact {#3-dot-4-collisional-impact}


### 3.5 Maxwell molecules and very hard particles {#3-dot-5-maxwell-molecules-and-very-hard-particles}


### 3.6 Inelastic gases {#3-dot-6-inelastic-gases}


### 3.7 Ballistic agglomeration {#3-dot-7-ballistic-agglomeration}


### 3.8 Single-lane traffic {#3-dot-8-single-lane-traffic}


### 3.9 Notes {#3-dot-9-notes}


## 4. Exclusion {#4-dot-exclusion}


### 4.1 Symmetric exclusion process {#4-dot-1-symmetric-exclusion-process}


### 4.2 Asymmetric exclusion process {#4-dot-2-asymmetric-exclusion-process}


### 4.3 Hydrodynamic approach {#4-dot-3-hydrodynamic-approach}


### 4.4 Microscopic approach {#4-dot-4-microscopic-approach}


### 4.5 Open systems {#4-dot-5-open-systems}


### 4.6 Notes {#4-dot-6-notes}


## 5. Aggregation {#5-dot-aggregation}


### 5.1 The master equations {#5-dot-1-the-master-equations}


### 5.2 Exact solution methods {#5-dot-2-exact-solution-methods}


### 5.3 Gelation {#5-dot-3-gelation}


### 5.4 Scaling {#5-dot-4-scaling}


### 5.5 Aggregation with input {#5-dot-5-aggregation-with-input}


### 5.6 Exchange-driven growth {#5-dot-6-exchange-driven-growth}


### 5.7 Notes {#5-dot-7-notes}


## 6. Fragmentation {#6-dot-fragmentation}


### 6.1 Binary fragmentation {#6-dot-1-binary-fragmentation}


### 6.2 Planar fragmentation {#6-dot-2-planar-fragmentation}


### 6.3 Reversible polymerization {#6-dot-3-reversible-polymerization}


### 6.4 Collisional fragmentation {#6-dot-4-collisional-fragmentation}


### 6.5 Notes {#6-dot-5-notes}


## 7. Adsorption {#7-dot-adsorption}


### 7.1 Random sequential adsorption in one dimension {#7-dot-1-random-sequential-adsorption-in-one-dimension}


### 7.2 Phase space structure {#7-dot-2-phase-space-structure}


### 7.3 Adsorption in higher dimensions {#7-dot-3-adsorption-in-higher-dimensions}


### 7.4 Reversible adsorption {#7-dot-4-reversible-adsorption}


### 7.5 Polymer translocation {#7-dot-5-polymer-translocation}


### 7.6 Notes {#7-dot-6-notes}


## 8. Spin dynamics {#8-dot-spin-dynamics}


### 8.1 Phenomenology of coarsening {#8-dot-1-phenomenology-of-coarsening}


### 8.2 The voter model {#8-dot-2-the-voter-model}


### 8.3 Ising-Glauber model {#8-dot-3-ising-glauber-model}


### 8.4 Mean-field approximation {#8-dot-4-mean-field-approximation}


### 8.5 Glauber dynamics in one dimension {#8-dot-5-glauber-dynamics-in-one-dimension}


### 8.6 Glauber dynamics in higher dimensions {#8-dot-6-glauber-dynamics-in-higher-dimensions}


### 8.7 Spin-exchange dynamics {#8-dot-7-spin-exchange-dynamics}


### 8.8 Cluster dynamics {#8-dot-8-cluster-dynamics}


### 8.9 Notes {#8-dot-9-notes}


## 9. Coarsening {#9-dot-coarsening}


### 9.1 Models {#9-dot-1-models}


### 9.2 Free evolution {#9-dot-2-free-evolution}


### 9.3 Case studies in non-conservative dynamics {#9-dot-3-case-studies-in-non-conservative-dynamics}


### 9.4 Final states {#9-dot-4-final-states}


### 9.5 Defects {#9-dot-5-defects}


### 9.6 Conservative dynamics {#9-dot-6-conservative-dynamics}


### 9.7 Extremal dynamics {#9-dot-7-extremal-dynamics}


### 9.8 Nucleation and growth {#9-dot-8-nucleation-and-growth}


### 9.9 Notes {#9-dot-9-notes}


## 10. Disorder {#10-dot-disorder}


### 10.1 Disordered spin chain {#10-dot-1-disordered-spin-chain}


### 10.2 Random walk in a random potential {#10-dot-2-random-walk-in-a-random-potential}


### 10.3 Random walk in random velocity {#10-dot-3-random-walk-in-random-velocity}


### 10.4 Notes {#10-dot-4-notes}


## 11. Hysteresis {#11-dot-hysteresis}


### 11.1 Homogeneous ferromagnets {#11-dot-1-homogeneous-ferromagnets}


### 11.2 Perturbation analysis {#11-dot-2-perturbation-analysis}


### 11.3 Disordered ferromagnets {#11-dot-3-disordered-ferromagnets}


### 11.4 Mean-field model {#11-dot-4-mean-field-model}


### 11.5 Hysteresis in the random-field Ising chain {#11-dot-5-hysteresis-in-the-random-field-ising-chain}


### 11.6 Notes {#11-dot-6-notes}


## 12. Population dynamics {#12-dot-population-dynamics}


### 12.1 Continuum formulation {#12-dot-1-continuum-formulation}


### 12.2 Discrete reactions {#12-dot-2-discrete-reactions}


### 12.3 Small-fluctuation expansion {#12-dot-3-small-fluctuation-expansion}

<!--list-separator-->

-  [interacting particle systems]({{< relref "interacting_particle_systems" >}})


### 12.4 Large fluctuations {#12-dot-4-large-fluctuations}


### 12.5 Notes {#12-dot-5-notes}


## 13. Diffusive reactions {#13-dot-diffusive-reactions}


### 13.1 Role of the spatial dimension {#13-dot-1-role-of-the-spatial-dimension}


### 13.2 The trapping reaction {#13-dot-2-the-trapping-reaction}


### 13.3 Two-species annihilation {#13-dot-3-two-species-annihilation}


### 13.4 Single-species reactions in one dimension {#13-dot-4-single-species-reactions-in-one-dimension}


### 13.5 Reactions in spatial gradients {#13-dot-5-reactions-in-spatial-gradients}


### 13.6 Notes {#13-dot-6-notes}


## 14. Complex networks {#14-dot-complex-networks}


### 14.1 Non-lattice networks {#14-dot-1-non-lattice-networks}


### 14.2 Evolving random graphs {#14-dot-2-evolving-random-graphs}


### 14.3 Random recursive trees {#14-dot-3-random-recursive-trees}


### 14.4 Preferential attachment {#14-dot-4-preferential-attachment}


### 14.5 Fluctuations in networks {#14-dot-5-fluctuations-in-networks}


### 14.6 Notes {#14-dot-6-notes}
